In [1]:
import pandas as pd
import numpy as np

In [2]:
# List of Tuples
students = [ ('jack', 34, 'Sydeny' , 'Australia') ,
('Riti', 30, 'Delhi' , 'India' ) ,
('Vikas', 31, 'Mumbai' , 'India' ) ,
('Neelu', 32, 'Bangalore' , 'India' ) ,
('John', 16, 'New York' , 'US') ,
('Mike', 17, 'las vegas' , 'US')  ]
#Create a DataFrame object
datos = pd.DataFrame(students, columns = ['Name' , 'Age', 'City' , 'Country'], index=['a', 'b', 'c' , 'd' , 'e' , 'f'])

In [3]:
datos

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai      India
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

In [6]:
datos[:3]

    Name  Age    City    Country
a   jack   34  Sydeny  Australia
b   Riti   30   Delhi      India
c  Vikas   31  Mumbai      India

In [7]:
datos.iat[2,3]

'India'

In [8]:
datos.iat[2,3] = 'Hola'

In [10]:
datos.iat[2,3]

'Hola'

In [11]:
datos

    Name  Age       City    Country
a   jack   34     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai       Hola
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US

In [13]:
datos.at['a' , 'Age']

34

In [14]:
datos.at['a' , 'Age'] = '0'

In [15]:
datos.at['a' , 'Age']

0

In [16]:
datos

    Name  Age       City    Country
a   jack    0     Sydeny  Australia
b   Riti   30      Delhi      India
c  Vikas   31     Mumbai       Hola
d  Neelu   32  Bangalore      India
e   John   16   New York         US
f   Mike   17  las vegas         US